{
  "headings": [
    {
      "title": "principle",
      "description": "The DevSecOps Principle you need to be good at to better move the needle for your org"
    },
    { "title": "level 1", "description": "Poorly controlled, reactive" },
    { "title": "level 2", "description": "Some minority adoption of basic best practices" },
    { "title": "level 3", "description": "Proactive not reactive, measured and controlled" },
    { "title": "level 4", "description": "Continuous improvement, pushing the envelope with advanced implementation of principles" }
  ],
  "principles": [
    {
      "principle": {
        "value": "Observability",
        "description": "How much observability do you have on your systems environments, inputs, outputs and behaviour. Do you have enough information on how your system runs to make improvements/solve problems?",
        "questions": ["How well does your current approach map to the <a href='observability-strategy'>Observability Strategy</a>"]
      },
      "level 1": {
        "value": "Out of the box - only",
        "description": "Just the basics you get for free from Cloudwatch, an on-server agent, htop, task manager etc.",
        "questions": [
          "Do you have to have to add lots of debug statements when there's a prod issue?",
          "Do prod issues often catch you off guard?",
          "You have little idea of how much Compute/Disk/Memory is being used by your components?",
          "You have no accurate handle on how many rpm your service is handling at a given time",
          "You have no historical view on application performance"
        ]
      },
      "level 2": {
        "value": "Basic instrumentation of portions of your stack",
        "description": "You should have some logging at least",
        "questions": [
          "Do you at least have APM turned on?",
          "Are your application logs going into a log aggregation platform?",
          "Do you have a historical view on application performance?",
          "Do you run synthetic tests to find out issues before your customers do?"
        ]
      },
      "level 3": {
        "value": "Decent coverage over all layers of the stack",
        "description": "You have to have really have some logging at least",
        "questions": [
          "Are your server/infrastructure logs going into a log aggregation platform?",
          "Can you easily track the effect of a release to production?",
          "Do you have multiple overlapping views on system health?",
          "Metrics aggregate into service quality dashboards and alerting systems"
        ]
      },
      "level 4": {
        "value": "Max Instrumentation and SLO driven dashboards",
        "description": "You can see and model your system behaviours.",
        "questions": [
          "Can you quickly triage issues and hone in on problems very shortly after they arise",
          "Do you have aggregate metrics that inform your SLOs (SLAs)?",
          "Do you have alerting and recording of your SLO performance over time?",
          "Do you have a good view on what \"normal\" looks like in terms of system behaviour?",
          "Do you have balanced and continuously improved alerting on abnormal system behaviour?",
          "You've got complete coverage of every transaction from start to finish",
          "Do you have extensive system dashboards that are used by technical and non-technical alike on a regular basis"
        ]
      },
      "scores": {
        "team 1": 0.65,
        "team 2": 0.11
      }
    },
    {
      "principle": {
        "value": "Development Practices",
        "description": "Good engineering practices in the SDLC that enable you to move fast and reduce legacy",
        "questions": [
          "Standardise work",
          "Improve quality",
          "Increase collaboration",
          "Legacy systems are systems that are hard to manage (nothing to do with age, just quality of architecture, code and supporting artifacts)"
        ]
      },
      "level 1": {
        "value": "Basic/Archaic dev practices",
        "description": "",
        "questions": [
          "You think git-flow is a good thing for high velocity projects",
          "You need access to a full integrated environment to do any development and testing",
          "It's difficult to deploy & release your software independently of the services that depend on it",
          "The majority of your projects have blank README.md files"
        ]
      },
      "level 2": {
        "value": "Starting to adopt modern dev practices",
        "description": "",
        "questions": [
          "You have long lived repo branches",
          "You have documentation, but it is divorced from the code",
          "Your documentation is done after the fact and is seen as separate task"
        ]
      },
      "level 3": {
        "value": "Well established practices",
        "description": "",
        "questions": [
          "Developers create and maintain their own acceptance tests",
          "Your documentation is updated as part of the code",
          "You pair on a lot of tasks",
          "You have fewer than 3 active and short lived branches at any time",
          "You use 'immutable' Architectural Decision records for system level decisions",
          "You use linting tools with agreed and communicated coding standards, integrated into your CI/CD",
          "You use semantic versioning for your code, libraries and deployable artifacts",
          "You stick to the <a href='https://12factor.net/'>12 factor app manifesto</a> as much as possible",
          "You use RFC's to discuss and communicate wide reaching engineering decisions"
        ]
      },
      "level 4": {
        "value": "Super optimised workflows, practices and cultures",
        "description": "",
        "questions": [
          "Your team's ways of working and preferences are documented and communicated",
          "Brittle integration tests are run in their own suite independent of stable tests",
          "You mob on problems quite often, increasing everybody's understanding",
          "You use trunk based development most or all of the time",
          "Your documentation is automatically generated as part of your CI/CD",
          "You can make large scale changes to your systems without creating significant work for other teams",
          "Your PR processes is very thorough and you can make/take suggestions without conflict"
        ]
      },
      "scores": {
        "team 1": 0.6,
        "team 2": 0.1
      }
    },
    {
      "principle": {
        "value": "CI/CD",
        "description": "Enable fast and quality flow from development to production reliably",
        "questions": [
          "Standardise work",
          "Improve Quality",
          "Lower Change fail rates",
          "Reduce Defects and re-work",
          "Reduce variability and batch sizes",
          "Relentlessly pursue continuous improvement",
          "Continuous Integration",
          "Continuous Delivery"
        ]
      },
      "level 1": {
        "value": "Basic CI/CD w/ lots of manual steps",
        "description": "You have a little CI/CD",
        "questions": [
          "Do you release multiple times in a month?",
          "Do you deploy at a decreasing frequency?",
          "Is your lead time for changes over 1 month?",
          "Is your change failure rate between 31-45%?",
          "Are your systems hand crafted and you have extensive snowflake servers?",
          "Are your deployment non-atomic, in a way that can leave environments in broken states following an in-CD failure?"
        ]
      },
      "level 2": {
        "value": "Some CI/CD and some tests",
        "description": "You have some CI/CD with the occasional manual deployment steps",
        "questions": [
          "Do you deploy at a constant frequency?",
          "Do you release multiple times a week?",
          "Is your lead time for changes between 1 week and 1 month?",
          "Is your change failure rate between 0-25%?"
        ]
      },
      "level 3": {
        "value": "Comprehensive CI/CD with solid & stable test suite",
        "description": "You have good CI/CD best practices and a regular deployment cadence",
        "questions": [
          "Your system and application config is kept in version control",
          "Your deploy >13 times a week",
          "Could you release multiple times a day?",
          "Your lead time for changes is between 1 day and 1 week",
          "Your change failure rate is between 0-20%",
          "You can do blue/green deployments",
          "You use version control for all production artifacts",
          "Your deployment processes are 90% automated and any manual steps are well documented",
          "Do you load test core components before major releases and revisions?",
          "You can make deployments during business hours with negligible downtime",
          "The majority of your deployments deploy in under 15mins"
        ]
      },
      "level 4": {
        "value": "Max CI/CD, tests and scans",
        "description": "You follow all best practice CI/CD and deploy on a high frequency",
        "questions": [
          "Do you deploy at an increasing frequency",
          "Do you continue to pursue continuous improvement and optimisations based on your telemetry",
          "Do you release multiple times an day? > 20 times ",
          "Your lead time for changes is between 1 hour and 1 day",
          "Your change failure rate is between 0-10%",
          "You regularly do canary deployments",
          "You make extensive use of feature flags",
          "You build and test artifacts in a virtual environment",
          "You scan for security vulnerabilities as part of CI/CD",
          "Do you load test core components before major releases and revisions?"
        ]
      },
      "scores": {
        "team 1": 0.8,
        "team 2": 0.1
      }
    },
    {
      "principle": {
        "value": "Security",
        "description": "Building security into the SDLC improves delivery performance and security quality",
        "questions": [
          "How far left have you managed to shift security?",
          "How secure are our systems and do we have a good view of attack vectors."
        ]
      },
      "level 1": {
        "value": "Little to no security practices",
        "description": "You have little to no Security",
        "questions": [
          "You have no security tooling enabled",
          "Patch management is patchy at best",
          "You store secrets in your code",
          "Do your customers, the media or developers tend to report security issues, as no automation is in place?",
          "Is security an afterthought, and only gets temporary engineering priority after embarrassing incidents?"
        ]
      },
      "level 2": {
        "value": "Basic practices but weak implementation",
        "description": "You have some security which is mostly reactionary",
        "questions": [
          "You have some security tooling enabled but nobody is actively pursuing vulns",
          "You have some view on vulnerabilities in your libraries",
          "You have some view on vulnerabilities in your operating system",
          "You use some secrets management",
          "You engage in some active patch management/platform updates",
          "You have SSO or MFA over the majority of your software tools",
          "You have some server endpoint protection"
        ]
      },
      "level 3": {
        "value": "Manual scanning and remediation",
        "description": "You have minimum security practices in place",
        "questions": [
          "Do your cloud accounts pass the CIS foundations benchmark v1.2",
          "Your platform and application logs saved and tracked for at least 1 year (or more depending on compliance reqs)",
          "Your secrets are stored in a secrets management platform (AWS SSM, AWS secrets manager, Hashicorp Vault)",
          "You have some threat modelling",
          "You have active cloud configuration monitoring and alerting (AWS config)",
          "You have active monitoring of your WAFS",
          "You have 'supply chain' CI/CD and daily code scanning looking for vulns in your libs and runtimes",
          "You have a SIEM solution in place with the majority of your infra, application and runtime logs being fed into there",
          "You have a DAST solution as part of your CI/CD as well as regular scans",
          "Your engineering teams have secure code training",
          "All your cloud infra is well tagged and attributable",
          "You have centralised server endpoint protection"
        ]
      },
      "level 4": {
        "value": "Multi layered security and compliance w/ quick remediation",
        "description": "You have extensive overlapping views of security related activity w/ regular automated scanning and well defined & observed remediation policy ",
        "questions": [
          "You have comprehensive threat modelling",
          "You have a well defined and observed remediation policy covering different types of issues",
          "You have configuration management and alerting",
          "You have implemented a container security strategy",
          "You have a team that have undergone incident response training",
          "Audit logs saved and tracked for at least 5 years if a (suspected) incident is found",
          "You use trusted, evergreen base images with regular releases",
          "You have red team exercise attempting to break your software",
          "You have a mature bug bounty programme in place",
          "You have monitored honeypots spread about the place",
          "You have a threat intelligence team/consultancy advising you on your security focus based on the threat landscape"
        ]
      },
      "scores": {
        "team 1": 0.5,
        "team 2": 0.05
      }
    },
    {
      "principle": {
        "value": "Availability",
        "description": "How do we keep things up and running",
        "questions": [
          "Can you recover quickly from incidents a low MTTR?",
          "Can you detect incidents ahead of time?",
          "Can you failover to backup systems"
        ]
      },
      "level 1": {
        "value": "Little to no availability practices",
        "description": "Little to no availability practices",
        "questions": ["Your MTTR (mean time to recovery) during an incident averages ~ 2d"]
      },
      "level 2": {
        "value": "Basic practices",
        "description": "You have some Availability",
        "questions": [
          "Your MTTR (mean time to recovery) during an incident averages ~ 1d",
          "You have some sort of runbooks"
        ]
      },
      "level 3": {
        "value": "Good practices and extensive measurement",
        "description": "You have good Availability",
        "questions": [
          "Your MTTR (mean time to recovery) during an incident averages < 6hr",
          "You're starting to follow the SRE approach and have started to documented your SLOs "
        ]
      },
      "level 4": {
        "value": "Fully adopted and rugged SRE",
        "description": "You have fully adopted SRE practices across the board",
        "questions": [
          "You follow the SRE approach and have well documented and customer negotiated SLOs and extensive SLIs feeding into them",
          "You continuously monitor and improve on your numbers",
          "Do you have a low and continuously improving MTTR? avg < 1hr",
          "You follow the <a href='https://ruggedsoftware.org/'>rugged manifesto</a>"
        ]
      },
      "scores": {
        "team 1": 0.7,
        "team 2": 0.1
      }
    },
    {
      "principle": {
        "value": "Durability",
        "description": "How good are our backups",
        "questions": [
          "Can you recover quickly from incidents a low MTTR?",
          "Do you have faith in your backups and evidence to support that?",
          "Can you guarantee low recovery point objectives?",
          "Can you failover to backup systems?"
        ]
      },
      "level 1": {
        "value": "You pay lip service to backups",
        "description": "You have almost no durability",
        "questions": [
          "You have a few paragraphs on your backup strategy tucked away in Confluence somewhere",
          "You have never really tested your backups"
        ]
      },
      "level 2": {
        "value": "You have a ad-hoc tested backup and restore strategy",
        "description": "You have occasionally tested restoring your backups on an ad-hoc basis",
        "questions": [
          "You have done some manual restores and quick checks",
          "Your backups strategy and patterns are documented reasonably well",
          "You're aware of the big things that aren't fully covered"
        ]
      },
      "level 3": {
        "value": "You have a regular tested backup and restore strategy",
        "description": "You have good durability and can sleep at night",
        "questions": [
          "You test backups and restores of components on a quarterly basis",
          "You have thought about all the data/system corruption failpoints consciously accept and communicate the risks",
          "You're fully aware of the things that aren't fully covered and have a strategy for them",
          "You backup to different cloud accounts to reduce blast radius for gross errors"
        ]
      },
      "level 4": {
        "value": "You can restore you entire system in under 2 hours",
        "description": "You have maximum Durability",
        "questions": [
          "You have high frequency backups",
          "You run >twice annual game days/chaos engineering where the entire infrastructure is destroyed",
          "You run regular game days/chaos engineering where the random parts of infrastructure are destroyed and recovered",
          "You rehearse and strive as a team to bring the recovery time down, even changing your architecture to make it more robust",
          "You have backups in different cloud providers"
        ]
      },
      "scores": {
        "team 1": 0.4,
        "team 2": 0.1
      }
    },
    {
      "principle": {
        "value": "Culture",
        "description": "This section highlights cultural styles and values within the company",
        "questions": ["How good is your culture?"]
      },
      "level 1": {
        "value": "Power-oriented culture",
        "description": "Very limited scope of responsibility, minimal cooperation, novelty is not welcomed, information is hidden",
        "questions": [
          "Do team members feel fear of asking for feedback?",
          "Is there a punitive culture?",
          "Is cross-communication discouraged?",
          "Do employees have little responsibility?",
          "Is information readily available?"
        ]
      },
      "level 2": {
        "value": "Rule-oriented culture",
        "description": "Modest cooperation, rule-following behaviour, narrow responsibility, novelty may lead to problems",
        "questions": [
          "Is the organisation fair?",
          "Does novelty leads to problems?",
          "Focus on departmental goals",
          "Failure leads to seek justice",
          "Is information shared?"
        ]
      },
      "level 3": {
        "value": "Trust-oriented culture",
        "description": "Trust-oriented culture",
        "questions": [
          "Is there trust across the organisational hierarchy?",
          "Is cross-functional collaboration encouraged?",
          "Is communication transparent?",
          "Are new ideas welcomed?",
          "Are risks shared?"
        ]
      },
      "level 4": {
        "value": "Performance-oriented",
        "description": "Goal oriented",
        "questions": [
          "Is there a focus on organisational goal?",
          "Is work recognised as meaningful?",
          "Is cross-functional collaboration established?",
          "Is innovation sought and implemented?",
          "is there a match between personal and organisational values?",
          "Is failure seen as an opportunity to improve the system?"
        ]
      },
      "scores": {
        "team 1": 0.7,
        "team 2": 0.2
      }
    }
  ]
}
